stm32-rs/stm32f4xx-hal/src/dma.rs
#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_channel!((Channel8, 8), (Channel9, 9),);

/// Contains types related to DMA configuration
pub mod config {
    use super::Bits;

    /// Priority of the DMA stream. Defaults to Medium. Deadlocks are resolved by
    /// the lower numbered stream gets priority.
    #[derive(Debug, Clone, Copy)]
    pub enum Priority {
        /// Low priority
        Low,
        /// Medium priority
        Medium,
        /// High priority
        High,
        /// Very high priority
        VeryHigh,
    }

    impl Bits<u8> for Priority {
        fn bits(self) -> u8 {
            match self {
                Priority::Low => 0,
                Priority::Medium => 1,
                Priority::High => 2,
                Priority::VeryHigh => 3,
            }
        }
    }

    /// Size of the transfer. Same type for memory and peripheral size but the values
    /// needn't be the same. Check the datasheet for how byte packing/unpacking works.
    #[derive(Debug, Clone, Copy)]
    pub enum TransferSize {
        /// 8-bit
        Byte,
        /// 16-bit
        HalfWord,
        /// 32-bit
        Word,
    }

    impl Bits<u8> for TransferSize {
        fn bits(self) -> u8 {
            match self {
                TransferSize::Byte => 0,
                TransferSize::HalfWord => 1,
                TransferSize::Word => 2,
            }
        }
    }

    /// The level to fill the fifo to before performing the transaction
    #[derive(Debug, Clone, Copy)]
    pub enum FifoThreshold {
        /// 1/4 full
        QuarterFull,
        /// 1/2 full
        HalfFull,
        /// 3/4 full
        ThreeQuarterFull,
        /// Full
        Full,
    }

    impl Bits<u8> for FifoThreshold {
        fn bits(self) -> u8 {
            match self {
                FifoThreshold::QuarterFull => 0,
                FifoThreshold::HalfFull => 1,
                FifoThreshold::ThreeQuarterFull => 2,
                FifoThreshold::Full => 3,
            }
        }
    }

    /// How burst transfers are done. Requires fifo enabled. Check datasheet for valid combinations.
    #[derive(Debug, Clone, Copy)]
    pub enum BurstMode {
        /// Single transfer, no burst
        NoBurst,
        /// Burst transfer of 4 beats
        Burst4,
        /// Burst transfer of 8 beats
        Burst8,
        /// Burst transfer of 16 beats
        Burst16,
    }

    impl Bits<u8> for BurstMode {
        fn bits(self) -> u8 {
            match self {
                BurstMode::NoBurst => 0,
                BurstMode::Burst4 => 1,
                BurstMode::Burst8 => 2,
                BurstMode::Burst16 => 3,
            }
        }
    }

    /// Is the DMA controller the flow controller or is the peripheral?
    #[derive(Debug, Clone, Copy)]
    pub enum FlowController {
        /// DMA controller is the flow controller
        Dma,
        /// Source or destination peripheral is the flow controller
        Peripheral,
    }

    impl Bits<bool> for FlowController {
        fn bits(self) -> bool {
            match self {
                FlowController::Dma => false,
                FlowController::Peripheral => true,
            }
        }
    }

    /// Contains the complete set of configuration for a DMA stream
    #[derive(Debug, Clone, Copy)]
    pub struct DmaConfig {
        pub(crate) memory_size: TransferSize,
        pub(crate) peripheral_size: TransferSize,
        pub(crate) number_of_transfers: Option<u16>,
        pub(crate) priority: Priority,
        pub(crate) memory_increment: bool,
        pub(crate) peripheral_increment: bool,
        pub(crate) transfer_complete_interrupt: bool,
        pub(crate) half_transfer_interrupt: bool,
        pub(crate) transfer_error_interrupt: bool,
        pub(crate) direct_mode_error_interrupt: bool,
        pub(crate) fifo_error_interrupt: bool,
        pub(crate) double_buffer: bool,
        pub(crate) fifo_threshold: FifoThreshold,
        pub(crate) fifo_enable: bool,
        pub(crate) memory_burst: BurstMode,
        pub(crate) peripheral_burst: BurstMode,
        pub(crate) flow_controller: FlowController,
    }

    impl Default for DmaConfig {
        fn default() -> Self {
            Self {
                memory_size: TransferSize::HalfWord,
                peripheral_size: TransferSize::HalfWord,
                number_of_transfers: None,
                priority: Priority::Medium,
                memory_increment: false,
                peripheral_increment: false,
                transfer_complete_interrupt: false,
                half_transfer_interrupt: false,
                transfer_error_interrupt: false,
                direct_mode_error_interrupt: false,
                fifo_error_interrupt: false,
                double_buffer: false,
                fifo_threshold: FifoThreshold::QuarterFull,
                fifo_enable: false,
                memory_burst: BurstMode::NoBurst,
                peripheral_burst: BurstMode::NoBurst,
                flow_controller: FlowController::Dma,
            }
        }
    }

    impl DmaConfig {
        /// Set the memory_size
        #[inline]
        pub fn memory_size(mut self, memory_size: TransferSize) -> Self {
            self.memory_size = memory_size;
            self
        }
        /// Set the peripheral_size
        #[inline]
        pub fn peripheral_size(mut self, peripheral_size: TransferSize) -> Self {
            self.peripheral_size = peripheral_size;
            self
        }
        /// Set the priority
        #[inline]
        pub fn priority(mut self, priority: Priority) -> Self {
            self.priority = priority;
            self
        }
        /// Set the number of transfers, the default number of transfers is the size of the buffer
        /// passed to the [`Transfer::init`] method.
        ///
        /// # Safety
        ///
        /// The user must ensure that the number of transfers fits in the buffer length, otherwise
        /// the DMA will overwrite arbitrary memory.
        ///
        /// [`Transfer::init`]: ../struct.Transfer.html#method.init
        #[inline]
        pub unsafe fn number_of_transfers(mut self, n_transfers: u16) -> Self {
            self.number_of_transfers = Some(n_transfers);
            self
        }
        /// Set the memory_increment
        #[inline]
        pub fn memory_increment(mut self, memory_increment: bool) -> Self {
            self.memory_increment = memory_increment;
            self
        }
        /// Set the peripheral_increment
        #[inline]
        pub fn peripheral_increment(mut self, peripheral_increment: bool) -> Self {
            self.peripheral_increment = peripheral_increment;
            self
        }
        /// Set the transfer_complete_interrupt
        #[inline]
        pub fn transfer_complete_interrupt(mut self, transfer_complete_interrupt: bool) -> Self {
            self.transfer_complete_interrupt = transfer_complete_interrupt;
            self
        }
        /// Set the half_transfer_interrupt
        #[inline]
        pub fn half_transfer_interrupt(mut self, half_transfer_interrupt: bool) -> Self {
            self.half_transfer_interrupt = half_transfer_interrupt;
            self
        }
        /// Set the transfer_error_interrupt
        #[inline]
        pub fn transfer_error_interrupt(mut self, transfer_error_interrupt: bool) -> Self {
            self.transfer_error_interrupt = transfer_error_interrupt;
            self
        }
        /// Set the direct_mode_error_interrupt
        #[inline]
        pub fn direct_mode_error_interrupt(mut self, direct_mode_error_interrupt: bool) -> Self {
            self.direct_mode_error_interrupt = direct_mode_error_interrupt;
            self
        }
        /// Set the fifo_error_interrupt
        #[inline]
        pub fn fifo_error_interrupt(mut self, fifo_error_interrupt: bool) -> Self {
            self.fifo_error_interrupt = fifo_error_interrupt;
            self
        }
        /// Set the double_buffer
        #[inline]
        pub fn double_buffer(mut self, double_buffer: bool) -> Self {
            self.double_buffer = double_buffer;
            self
        }
        /// Set the fifo_threshold
        #[inline]
        pub fn fifo_threshold(mut self, fifo_threshold: FifoThreshold) -> Self {
            self.fifo_threshold = fifo_threshold;
            self
        }
        /// Set the fifo_enable
        #[inline]
        pub fn fifo_enable(mut self, fifo_enable: bool) -> Self {
            self.fifo_enable = fifo_enable;
            self
        }
        /// Set the memory_burst
        #[inline]
        pub fn memory_burst(mut self, memory_burst: BurstMode) -> Self {
            self.memory_burst = memory_burst;
            self
        }
        /// Set the peripheral_burst
        #[inline]
        pub fn peripheral_burst(mut self, peripheral_burst: BurstMode) -> Self {
            self.peripheral_burst = peripheral_burst;
            self
        }
        /// Set the flow_controller
        #[inline]
        pub fn flow_controller(mut self, flow_controller: FlowController) -> Self {
            self.flow_controller = flow_controller;
            self
        }
    }
}

/// DMA Stream
pub struct Transfer<STREAM, CHANNEL, PERIPHERAL, DIRECTION, BUF>
where
    STREAM: Stream,
    PERIPHERAL: PeriAddress,
    BUF: StableDeref + DerefMut + 'static,
    BUF::Target: AsMutSlice<Element = <PERIPHERAL as PeriAddress>::MemSize>,
{
    stream: STREAM,
    _channel: PhantomData<CHANNEL>,
    peripheral: PERIPHERAL,
    _direction: PhantomData<DIRECTION>,
    buf: Option<BUF>,
    double_buf: Option<BUF>,
}

