stm32-rs/stm32f4xx-hal/src/dma.rs
impl<STREAM, CHANNEL, PERIPHERAL, DIR, BUF> Transfer<STREAM, CHANNEL, PERIPHERAL, DIR, BUF>
where
    STREAM: Stream,
    CHANNEL: Channel,
    DIR: Direction,
    PERIPHERAL: PeriAddress,
    BUF: StableDeref + DerefMut + 'static,
    BUF::Target: AsMutSlice<Element = <PERIPHERAL as PeriAddress>::MemSize>,
    (STREAM, CHANNEL, PERIPHERAL, DIR): Sealed,
{
    /// Applies all fields in DmaConfig
    pub fn apply_config(&mut self, config: config::DmaConfig) {
        let was_enabled = <STREAM>::is_enabled();
        if was_enabled {
            self.stream.disable();
        }

        self.stream.clear_interrupts();
        self.stream.set_priority(config.priority);
        self.stream.set_memory_size(config.memory_size);
        self.stream.set_peripheral_size(config.peripheral_size);
        self.stream.set_memory_increment(config.memory_increment);
        self.stream
            .set_peripheral_increment(config.peripheral_increment);
        self.stream
            .set_transfer_complete_interrupt_enable(config.transfer_complete_interrupt);
        self.stream
            .set_half_transfer_interrupt_enable(config.half_transfer_interrupt);
        self.stream
            .set_transfer_error_interrupt_enable(config.transfer_error_interrupt);
        self.stream
            .set_direct_mode_error_interrupt_enable(config.direct_mode_error_interrupt);
        self.stream
            .set_fifo_error_interrupt_enable(config.fifo_error_interrupt);
        self.stream.set_double_buffer(config.double_buffer);
        self.stream.set_fifo_threshold(config.fifo_threshold);
        self.stream.set_fifo_enable(config.fifo_enable);
        self.stream.set_memory_burst(config.memory_burst);
        self.stream.set_peripheral_burst(config.peripheral_burst);
        self.stream.set_flow_controller(config.flow_controller);

        if was_enabled {
            unsafe {
                self.stream.enable();
            }
        }
    }

    /// Configures DMA stream to correct channel for peripheral, configures source and destination
    /// addresses and applies supplied configuration. In a memory to memory transfer the `double_buf`
    /// argument is source of the data.
    pub fn init(
        mut stream: STREAM,
        peripheral: PERIPHERAL,
        memory: BUF,
        double_buf: Option<BUF>,
        config: config::DmaConfig,
    ) -> Self {
        stream.disable();

        // Set the channel
        stream.set_channel(CHANNEL::new());

        // Set peripheral to memory mode
        stream.set_direction(DIR::new());

        let buf_slice = memory.as_slice();
        // Set the memory address
        stream.set_memory_address(buf_slice.as_ptr() as u32);

        let is_mem2mem = DIR::direction() == DmaDirection::MemoryToMemory;
        if is_mem2mem {
            // Fifo must be enabled for memory to memory
            assert!(config.fifo_enable);
        } else {
            // Set the peripheral address
            stream.set_peripheral_address(peripheral.address());
        }

        if let Some(ref db) = double_buf {
            if is_mem2mem {
                // Double buffer is the source in mem2mem mode
                stream.set_peripheral_address(db.as_slice().as_ptr() as u32);
            } else {
                stream.set_memory_double_buffer_address(db.as_slice().as_ptr() as u32);
            }
        } else {
            // Double buffer mode must not be enabled if we haven't been given a second buffer
            assert!(!config.double_buffer);
        }

        let n_transfers = if let Some(n) = config.number_of_transfers {
            n
        } else {
            buf_slice.len() as u16
        };
        stream.set_number_of_transfers(n_transfers);

        let mut transfer = Self {
            stream,
            _channel: PhantomData,
            peripheral: peripheral,
            _direction: PhantomData,
            buf: Some(memory),
            double_buf,
        };
        transfer.apply_config(config);

        transfer
    }

    /// Starts the transfer, the closure will be executed right after enabling the stream.
    pub fn start<F>(&mut self, f: F)
    where
        F: FnOnce(&mut PERIPHERAL),
    {
        // "Preceding reads and writes cannot be moved past subsequent writes"
        compiler_fence(Ordering::Release);

        unsafe {
            self.stream.enable();
        }
        f(&mut self.peripheral);
    }

    /// Pauses the dma stream, the closure will be executed right before disabling the stream.
    pub fn pause<F>(&mut self, f: F)
    where
        F: FnOnce(&mut PERIPHERAL),
    {
        f(&mut self.peripheral);
        self.stream.disable()
    }

    /// Changes the buffer and restarts or continues a double buffer transfer. This must be called
    /// immediately after a transfer complete event. The closure must return `(BUF, T)` where BUF
    /// is the new buffer to be used. The closure will not be called if the transfer is not
    /// completed.
    pub fn next_transfer<F, T>(&mut self, f: F) -> Result<T, DMAError>
    where
        F: FnOnce(BUF) -> (BUF, T),
    {
        if !STREAM::get_transfer_complete_flag() {
            return Err(DMAError::NotReady);
        }
        self.stream.clear_transfer_complete_interrupt();

        if self.double_buf.is_some() && DIR::direction() != DmaDirection::MemoryToMemory {
            // double buffering, unwrap can never fail
            let db = self.double_buf.take().unwrap();
            let r = f(db);
            let new_buf = r.0;
            if STREAM::current_buffer() == CurrentBuffer::DoubleBuffer {
                self.stream
                    .set_memory_address(new_buf.as_slice().as_ptr() as u32);
                self.double_buf.replace(new_buf);

                // "Subsequent reads and writes cannot be moved ahead of preceding reads"
                compiler_fence(Ordering::Acquire);

                return Ok(r.1);
            } else {
                self.stream
                    .set_memory_double_buffer_address(new_buf.as_slice().as_ptr() as u32);
                self.double_buf.replace(new_buf);

                // "Subsequent reads and writes cannot be moved ahead of preceding reads"
                compiler_fence(Ordering::Acquire);

                return Ok(r.1);
            }
        }
        self.stream.disable();

        // "No re-ordering of reads and writes across this point is allowed"
        compiler_fence(Ordering::SeqCst);

        // Can never fail, we never let the Transfer without a buffer
        let old_buf = self.buf.take().unwrap();
        let r = f(old_buf);
        let new_buf = r.0;

        let new_buf_slice = new_buf.as_slice();
        self.stream
            .set_memory_address(new_buf_slice.as_ptr() as u32);
        self.stream
            .set_number_of_transfers(new_buf_slice.len() as u16);
        self.buf.replace(new_buf);

        // "Preceding reads and writes cannot be moved past subsequent writes"
        compiler_fence(Ordering::Release);

        unsafe {
            self.stream.enable();
        }

        Ok(r.1)
    }

    /// Stops the stream and returns the underlying Resources
    pub fn free(mut self) -> (STREAM, PERIPHERAL, BUF, Option<BUF>) {
        self.stream.disable();
        self.stream.clear_interrupts();
        let Self {
            stream,
            peripheral,
            buf,
            double_buf,
            ..
        } = self;
        (stream, peripheral, buf.unwrap(), double_buf)
    }
}

macro_rules! dma_map {
    ($(($Stream:ty, $channel:ty, $Peripheral:ty, $dir:ty)),+ $(,)*) => {
        $(
            impl Sealed for ($Stream, $channel, $Peripheral, $dir) {}
        )+
    };
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        Stream0<DMA1>,
        Channel2,
        CCR1<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH1
    (
        Stream0<DMA1>,
        Channel2,
        CCR1<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH1
    (
        Stream2<DMA1>,
        Channel5,
        CCR4<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH4
    (
        Stream2<DMA1>,
        Channel5,
        CCR4<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH4
    (
        Stream2<DMA1>,
        Channel5,
        DMAR<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_UP
    (
        Stream2<DMA1>,
        Channel5,
        DMAR<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_UP
    (
        Stream3<DMA1>,
        Channel2,
        CCR2<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH2
    (
        Stream3<DMA1>,
        Channel2,
        CCR2<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH2
    (
        Stream4<DMA1>,
        Channel5,
        CCR1<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH1
    (
        Stream4<DMA1>,
        Channel5,
        CCR1<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH1
    (
        Stream4<DMA1>,
        Channel5,
        DMAR<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_TRIG
    (
        Stream4<DMA1>,
        Channel5,
        DMAR<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_TRIG
    (
        Stream5<DMA1>,
        Channel3,
        CCR1<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH1
    (
        Stream5<DMA1>,
        Channel3,
        CCR1<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH1
    (
        Stream5<DMA1>,
        Channel5,
        CCR2<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH2
    (
        Stream5<DMA1>,
        Channel5,
        CCR2<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH2
    (
        Stream6<DMA1>,
        Channel2,
        DMAR<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_UP
    (
        Stream6<DMA1>,
        Channel2,
        DMAR<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_UP
    (
        Stream6<DMA1>,
        Channel3,
        CCR2<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH2
    (
        Stream6<DMA1>,
        Channel3,
        CCR2<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH2
    (
        Stream6<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        Stream6<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        Stream7<DMA1>,
        Channel2,
        CCR3<stm32::TIM4>,
        MemoryToPeripheral
    ), //TIM4_CH3
    (
        Stream7<DMA1>,
        Channel2,
        CCR3<stm32::TIM4>,
        PeripheralToMemory
    ), //TIM4_CH3
    (
        Stream7<DMA1>,
        Channel5,
        CCR3<stm32::TIM3>,
        MemoryToPeripheral
    ), //TIM3_CH3
    (
        Stream7<DMA1>,
        Channel5,
        CCR3<stm32::TIM3>,
        PeripheralToMemory
    ), //TIM3_CH3
    (Stream0<DMA1>, Channel0, stm32::SPI3, PeripheralToMemory), //SPI3_RX
    (Stream2<DMA1>, Channel0, stm32::SPI3, PeripheralToMemory), //SPI3_RX
    (Stream4<DMA1>, Channel3, stm32::I2C3, MemoryToPeripheral), //I2C3_TX
    (Stream5<DMA1>, Channel0, stm32::SPI3, MemoryToPeripheral), //SPI3_TX
    (Stream7<DMA1>, Channel0, stm32::SPI3, MemoryToPeripheral), //SPI3_TX
                                                                //(stm32::DMA2, Stream3, Channel4, stm32::SDIO, MemoryToPeripheral), //SDIO
                                                                //(stm32::DMA2, Stream3, Channel4, stm32::SDIO, PeripheralToMemory), //SDIO
                                                                //(stm32::DMA2, Stream6, Channel4, stm32::SDIO, MemoryToPeripheral), //SDIO
                                                                //(stm32::DMA2, Stream6, Channel4, stm32::SDIO, PeripheralToMemory), //SDIO
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM4>, ccr1, u16),
    (CCR4<stm32::TIM3>, ccr4, u16),
    (CCR1<stm32::TIM2>, ccr1, u16),
    (CCR1<stm32::TIM3>, ccr1, u16),
    (CCR2<stm32::TIM2>, ccr2, u16),
    (CCR2<stm32::TIM3>, ccr2, u16),
    (CCR2<stm32::TIM4>, ccr2, u16),
    (CCR3<stm32::TIM3>, ccr3, u16),
    (CCR3<stm32::TIM4>, ccr3, u16),
    (CCR4<stm32::TIM2>, ccr4, u16),
    (DMAR<stm32::TIM3>, dmar, u16),
    (DMAR<stm32::TIM4>, dmar, u16),
    (stm32::SPI3, dr, u8),
    (stm32::I2C3, dr, u8),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        Stream0<DMA1>,
        Channel6,
        CCR3<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH3
    (
        Stream0<DMA1>,
        Channel6,
        CCR3<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH3
    (
        Stream0<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_UP
    (
        Stream0<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_UP
    (
        Stream1<DMA1>,
        Channel6,
        CCR4<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH4
    (
        Stream1<DMA1>,
        Channel6,
        CCR4<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH4
    (
        Stream1<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_TRIG
    (
        Stream1<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_TRIG
    (
        Stream2<DMA1>,
        Channel6,
        CCR1<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH1
    (
        Stream2<DMA1>,
        Channel6,
        CCR1<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH1
    (
        Stream3<DMA1>,
        Channel6,
        CCR4<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH4
    (
        Stream3<DMA1>,
        Channel6,
        CCR4<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH4
    (
        Stream3<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_TRIG
    (
        Stream3<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_TRIG
    (
        Stream4<DMA1>,
        Channel6,
        CCR2<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_CH2
    (
        Stream4<DMA1>,
        Channel6,
        CCR2<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_CH2
    (
        Stream6<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        MemoryToPeripheral
    ), //TIM5_UP
    (
        Stream6<DMA1>,
        Channel6,
        DMAR<stm32::TIM5>,
        PeripheralToMemory
    ), //TIM5_UP
    (
        Stream0<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_TRIG
    (
        Stream0<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_TRIG
    (
        Stream1<DMA2>,
        Channel6,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        Stream1<DMA2>,
        Channel6,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        Stream2<DMA2>,
        Channel6,
        CCR2<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH2
    (
        Stream2<DMA2>,
        Channel6,
        CCR2<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH2
    (
        Stream3<DMA2>,
        Channel6,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        Stream3<DMA2>,
        Channel6,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        Stream4<DMA2>,
        Channel6,
        CCR4<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH4
    (
        Stream4<DMA2>,
        Channel6,
        CCR4<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH4
    (
        Stream4<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_TRIG/COM
    (
        Stream4<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_TRIG/COM
    (
        Stream5<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_UP
    (
        Stream5<DMA2>,
        Channel6,
        DMAR<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_UP
    (
        Stream6<DMA2>,
        Channel0,
        CCR1<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH1
    (
        Stream6<DMA2>,
        Channel0,
        CCR1<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH1
    (
        Stream6<DMA2>,
        Channel0,
        CCR2<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH2
    (
        Stream6<DMA2>,
        Channel0,
        CCR2<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH2
    (
        Stream6<DMA2>,
        Channel0,
        CCR3<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH3
    (
        Stream6<DMA2>,
        Channel0,
        CCR3<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH3
    (
        Stream6<DMA2>,
        Channel6,
        CCR3<stm32::TIM1>,
        MemoryToPeripheral
    ), //TIM1_CH3
    (
        Stream6<DMA2>,
        Channel6,
        CCR3<stm32::TIM1>,
        PeripheralToMemory
    ), //TIM1_CH3
    (Stream0<DMA1>, Channel1, stm32::I2C1, PeripheralToMemory), //I2C1_RX
    (Stream2<DMA1>, Channel7, stm32::I2C2, PeripheralToMemory), //I2C2_RX
    (Stream3<DMA1>, Channel0, stm32::SPI2, PeripheralToMemory), //SPI2_RX
    (Stream3<DMA1>, Channel7, stm32::I2C2, PeripheralToMemory), //I2C2_RX
    (Stream4<DMA1>, Channel0, stm32::SPI2, MemoryToPeripheral), //SPI2_TX
    (Stream5<DMA1>, Channel1, stm32::I2C1, PeripheralToMemory), //I2C1_RX
    (Stream5<DMA1>, Channel4, stm32::USART2, PeripheralToMemory), //USART2_RX
    (Stream6<DMA1>, Channel4, stm32::USART2, MemoryToPeripheral), //USART2_TX
    (Stream7<DMA1>, Channel7, stm32::I2C2, MemoryToPeripheral), //I2C2_TX
    (Stream0<DMA2>, Channel0, stm32::ADC1, PeripheralToMemory), //ADC1
    (Stream0<DMA2>, Channel3, stm32::SPI1, PeripheralToMemory), //SPI1_RX
    (Stream1<DMA2>, Channel5, stm32::USART6, PeripheralToMemory), //USART6_RX
    (Stream2<DMA2>, Channel3, stm32::SPI1, PeripheralToMemory), //SPI1_RX
    (Stream2<DMA2>, Channel4, stm32::USART1, PeripheralToMemory), //USART1_RX
    (Stream2<DMA2>, Channel5, stm32::USART6, PeripheralToMemory), //USART6_RX
    (Stream4<DMA2>, Channel0, stm32::ADC1, PeripheralToMemory), //ADC1
    (Stream5<DMA2>, Channel4, stm32::USART1, PeripheralToMemory), //USART1_RX
    (Stream6<DMA2>, Channel5, stm32::USART6, MemoryToPeripheral), //USART6_TX
    (Stream7<DMA2>, Channel4, stm32::USART1, MemoryToPeripheral), //USART1_TX
    (Stream7<DMA2>, Channel5, stm32::USART6, MemoryToPeripheral), //USART6_TX
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u8>,
        MemoryToMemory<u8>
    ),
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u16>,
        MemoryToMemory<u16>
    ),
    (
        Stream0<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream1<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream2<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream3<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream4<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream5<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream6<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
    (
        Stream7<DMA2>,
        Channel0,
        MemoryToMemory<u32>,
        MemoryToMemory<u32>
    ),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM1>, ccr1, u16),
    (CCR2<stm32::TIM1>, ccr2, u16),
    (CCR3<stm32::TIM1>, ccr3, u16),
    (CCR4<stm32::TIM1>, ccr4, u16),
    (DMAR<stm32::TIM1>, dmar, u16),
    (CCR1<stm32::TIM5>, ccr1, u16),
    (CCR2<stm32::TIM5>, ccr2, u16),
    (CCR3<stm32::TIM5>, ccr3, u16),
    (CCR4<stm32::TIM5>, ccr4, u16),
    (DMAR<stm32::TIM5>, dmar, u16),
    (stm32::ADC1, dr, u16),
    (stm32::I2C1, dr, u8),
    (stm32::I2C2, dr, u8),
    (stm32::SPI1, dr, u8),
    (stm32::SPI2, dr, u8),
    (stm32::USART1, dr, u8),
    (stm32::USART2, dr, u8),
    (stm32::USART6, dr, u8),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
))]
dma_map!(
    (Stream1<DMA1>, Channel1, stm32::I2C3, PeripheralToMemory), //I2C3_RX
    (Stream2<DMA1>, Channel3, stm32::I2C3, PeripheralToMemory), //I2C3_RX:DMA_CHANNEL_3
);

