stm32-rs/stm32f4xx-hal/src/dma.rs
#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
dma_map!(
    (
        Stream1<DMA1>,
        Channel3,
        CCR3<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH3
    (
        Stream1<DMA1>,
        Channel3,
        CCR3<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH3
    (
        Stream1<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        Stream1<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        Stream7<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        Stream7<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        Stream7<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        Stream7<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
address!(
    (CCR3<stm32::TIM2>, ccr3, u16),
    (DMAR<stm32::TIM2>, dmar, u16),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!((Stream5<DMA1>, Channel6, stm32::I2C3, MemoryToPeripheral),); //I2C3_TX:DMA_CHANNEL_6);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream6<DMA1>, Channel1, stm32::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream7<DMA1>, Channel1, stm32::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream3<DMA2>, Channel3, stm32::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream5<DMA2>, Channel3, stm32::SPI1, MemoryToPeripheral), //SPI1_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA2>, Channel4, stm32::SPI4, PeripheralToMemory), //SPI4_RX
    (Stream1<DMA2>, Channel4, stm32::SPI4, MemoryToPeripheral), //SPI4_TX
    (Stream3<DMA2>, Channel5, stm32::SPI4, PeripheralToMemory), //SPI4_RX:DMA_CHANNEL_5
    (Stream4<DMA2>, Channel5, stm32::SPI4, MemoryToPeripheral), //SPI4_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((stm32::SPI4, dr, u8),);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, Channel4, stm32::UART5, PeripheralToMemory), //UART5_RX
    (Stream2<DMA1>, Channel4, stm32::UART4, PeripheralToMemory), //UART4_RX
    (Stream4<DMA1>, Channel4, stm32::UART4, MemoryToPeripheral), //UART4_TX
                                                                 //(stm32::DMA1, Stream6, Channel7, stm32::DAC, MemoryToPeripheral), //DAC2
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (stm32::UART4, dr, u8),
    (stm32::UART5, dr, u8),
    //(stm32::DAC, ??),
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (
        Stream1<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        Stream1<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        Stream1<DMA1>,
        Channel3,
        CCR3<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH3
    (
        Stream1<DMA1>,
        Channel3,
        CCR3<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH3
    //(stm32::DMA1, Stream2, Channel1, DMAR<stm32::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream2, Channel1, DMAR<stm32::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream4, Channel1, DMAR<stm32::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(stm32::DMA1, Stream4, Channel1, DMAR<stm32::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    (
        Stream7<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_UP
    (
        Stream7<DMA1>,
        Channel3,
        DMAR<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_UP
    (
        Stream7<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        MemoryToPeripheral
    ), //TIM2_CH4
    (
        Stream7<DMA1>,
        Channel3,
        CCR4<stm32::TIM2>,
        PeripheralToMemory
    ), //TIM2_CH4
    (
        Stream1<DMA2>,
        Channel7,
        DMAR<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_UP
    (
        Stream1<DMA2>,
        Channel7,
        DMAR<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_UP
    (
        Stream2<DMA2>,
        Channel0,
        CCR1<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH1
    (
        Stream2<DMA2>,
        Channel0,
        CCR1<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH1
    (
        Stream2<DMA2>,
        Channel0,
        CCR2<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH2
    (
        Stream2<DMA2>,
        Channel0,
        CCR2<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH2
    (
        Stream2<DMA2>,
        Channel0,
        CCR3<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH3
    (
        Stream2<DMA2>,
        Channel0,
        CCR3<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH3
    (
        Stream2<DMA2>,
        Channel7,
        CCR1<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH1
    (
        Stream2<DMA2>,
        Channel7,
        CCR1<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH1
    (
        Stream3<DMA2>,
        Channel7,
        CCR2<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH2
    (
        Stream3<DMA2>,
        Channel7,
        CCR2<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH2
    (
        Stream4<DMA2>,
        Channel7,
        CCR3<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH3
    (
        Stream4<DMA2>,
        Channel7,
        CCR3<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH3
    (
        Stream7<DMA2>,
        Channel7,
        CCR4<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_CH4
    (
        Stream7<DMA2>,
        Channel7,
        CCR4<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_CH4
    (
        Stream7<DMA2>,
        Channel7,
        DMAR<stm32::TIM8>,
        MemoryToPeripheral
    ), //TIM8_COM/TRIG
    (
        Stream7<DMA2>,
        Channel7,
        DMAR<stm32::TIM8>,
        PeripheralToMemory
    ), //TIM8_COM/TRIG
    (Stream1<DMA1>, Channel4, stm32::USART3, PeripheralToMemory), //USART3_RX
    (Stream3<DMA1>, Channel4, stm32::USART3, MemoryToPeripheral), //USART3_TX
    (Stream4<DMA1>, Channel7, stm32::USART3, MemoryToPeripheral), //USART3_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (CCR1<stm32::TIM8>, ccr1, u16),
    (CCR2<stm32::TIM8>, ccr2, u16),
    (CCR3<stm32::TIM8>, ccr3, u16),
    (CCR4<stm32::TIM8>, ccr4, u16),
    (DMAR<stm32::TIM8>, dmar, u16),
    (CCR3<stm32::TIM2>, ccr3, u16),
    (DMAR<stm32::TIM2>, dmar, u16),
    //(DMAR<stm32::TIM7>, dmar), //Missing?
    (stm32::USART3, dr, u8),
);

